clean up code for ICML submission
